OpenFOAM-v1812/tutorials/incompressible/pimpleFoam/laminar/cylinder2D/system/DMDs/stdmd27
// -*- C++ -*-

stdmd27
{
    ${stdmd01}

    field          p;
    region         coarseMesh;
    maxRank        5;
    modeSorter     kiewat;
}


// ************************************************************************* //
