OpenFOAM-v1812/tutorials/incompressible/pimpleFoam/laminar/cylinder2D/system/DMDs/stdmd45
// -*- C++ -*-

stdmd45
{
    ${stdmd01}

    field          UPrime2Mean;
    patch          cylinder;
}


// ************************************************************************* //
